Core/src/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/AccumulationRegisters/ДниОтпускаСотрудников/ДниОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДниОтпускаСотрудников</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисленияОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Documents/ОтпускаСотрудников/ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтпускаСотрудников</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ДниОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботу</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <type>
        <types>CatalogRef.AzRyDivision</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Catalogs/Сотрудники/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает новый элемент справочника Сотрудники и возвращает его ссылку
//
// ДанныеНовогоСотрудника - (Структура) данных нового элемента, где
//
//		Ключ 		- имя реквизита справочника Сотрудники;
//		Значение	= значение, которое должно записаться в реквизит;
//
// ОбновлениеИнформационнойБазы.ЗаписатьОбъект() - неиспользуем потому, что идет перехват Исключения
//
Функция СоздатьНовогоСотрудника(Знач ДанныеНовогоСотрудника, Знач РегистрироватьНаУзлахПлановОбмена = Истина, Знач ОтключитьБизнесЛогику = Ложь) Экспорт
	
	СправочникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СправочникОбъект, ДанныеНовогоСотрудника);
	
	Если НЕ (ДанныеНовогоСотрудника.Свойство("Код") 
		И ЗначениеЗаполнено(ДанныеНовогоСотрудника.Код)) Тогда
		
		СправочникОбъект.УстановитьНовыйКод();
		
	КонецЕсли;
	
	СправочникОбъект.ОбменДанными.Загрузка = ОтключитьБизнесЛогику;
	Если Не РегистрироватьНаУзлахПлановОбмена Тогда
		
		СправочникОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		СправочникОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		
	КонецЕсли;
	
	СправочникОбъект.Записать(); 
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции // СоздатьНовогоСотрудника()

Процедура УстановитьОсновногоОтветственногоДляПользователя(НовыйОсновнойОтветственный, Пользователь, ОбновитьЗначениеНастройки = Ложь) Экспорт
	
	// Установим настройку, если пользователю не назначен ответственный
	ОсновнойОтветственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
	Если (ЗначениеЗаполнено(ОсновнойОтветственный)
		И ОбновитьЗначениеНастройки)
			ИЛИ НЕ ЗначениеЗаполнено(ОсновнойОтветственный) Тогда
		
		УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(НовыйОсновнойОтветственный, "ОсновнойОтветственный", Пользователь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТрудовойДоговорМикропредприятий") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ТрудовойДоговорМикропредприятий",
			НСтр("ka='Трудовой договор (микропредприятий)';ru='Трудовой договор (микропредприятий)';en='Employment contract (micro)'"),
			СформироватьПечатнуюФормуТрудовойДоговорМикропредприятий(МассивОбъектов, ОбъектыПечати));
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СведеньяПоОтпускам") Тогда
			
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_СведеньяПоОтпускам",
			НСтр("ka='Сведенья по отпускам';ru='Сведенья по отпускам';en='Сведенья по отпускам'"),
			СформироватьПечатнуюФормуСведеньяПоОтпускам(МассивОбъектов, ОбъектыПечати));
			
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Трудовой договор микропредприятий
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТрудовойДоговорМикропредприятий";
	КомандаПечати.Представление = НСтр("ka='Трудовой договор (микропредприятий)';ru='Трудовой договор (микропредприятий)';en='Employment contract (micro)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.СписокФорм = "ФормаСписка";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СведеньяПоОтпускам";
	КомандаПечати.Представление = НСтр("ka='Сведенья по отпускам';ru='Сведенья по отпускам';en='Сведенья по отпускам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.СписокФорм = "ФормаСписка";
	КомандаПечати.Порядок = 2;
	
КонецПроцедуры

#КонецОбласти


#Область ТрудовойДоговорМикропредприятий

Функция  СформироватьПечатнуюФормуТрудовойДоговорМикропредприятий(МассивОбъектов, ОбъектыПечати, ДистанционныеРаботы = Ложь, ДоговорСНадомником = Ложь)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_ТрудовойДоговорМикропредприятий");
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_ТрудовойДоговорМикропредприятий";
	
	ДанныеДоговоров = ДанныеТрудовыхДоговоров(МассивОбъектов, ДистанционныеРаботы, ДоговорСНадомником);
	Для каждого ДанныеДоговора Из ДанныеДоговоров Цикл
		
		НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
		
		Если НомерСтрокиНачало > 1 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТаблицаТрудовогоДоговора = Новый ТабличныйДокумент;
		
		ПараметрыНумерации = Новый Структура;
		УстановитьНомерРазделаВПараметрахНумерации(ПараметрыНумерации, 1);
		УстановитьНомерПунктаВПараметрахНумерации(ПараметрыНумерации, 1);
		
		ТрудовойДоговорВывестиРаздел("Шапка", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ОбщиеПоложения", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ПраваИОбязанностиРаботника", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ПраваИОбязанностиРаботодателя", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ОплатаТрудаРаботника", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_РабочееВремяИВремяОтдыхаРаботника", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ОхранаТруда", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_СоциальноеСтрахованиеИИныеГарантии", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ИныеУсловияТрудовогоДоговора", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ИзменениеУсловийТрудовогоДоговора", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ОтветственностьСторонТрудовогоДоговора", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Раздел_ЗаключительныеПоложения", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		ТрудовойДоговорВывестиРаздел("Подвал", ТаблицаТрудовогоДоговора, Макет, ДанныеДоговора, ПараметрыНумерации);
		
		ДокументРезультат.Вывести(ТаблицаТрудовогоДоговора);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.Ссылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция  СформироватьПечатнуюФормуСведеньяПоОтпускам(МассивОбъектов, ОбъектыПечати, ДистанционныеРаботы = Ложь, ДоговорСНадомником = Ложь)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Сотрудники.ПФ_MXL_СведеньяПоОтпускам");
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	тзНакопленоЗаГодаВПериоде = Новый ТаблицаЗначений;
	тзНакопленоЗаГодаВПериоде.Колонки.Добавить("Период");
	тзНакопленоЗаГодаВПериоде.Колонки.Добавить("КолвоДней");
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_СведеньяПоОтпускам";
	
	ОбластьШапка 						= Макет.ПолучитьОбласть("Шапка");
	ОбластьДокументДатаДокумента 		= Макет.ПолучитьОбласть("ДокументДатаДокумента");
	ОбластьИнформацияПервогоДокумента 	= Макет.ПолучитьОбласть("ИнформацияПервогоДокумента");
	ОбластьНакоплено 					= Макет.ПолучитьОбласть("Накоплено");
	ОбластьПериодОтпуска 				= Макет.ПолучитьОбласть("ПериодОтпуска");
	ОбластьПодвал 						= Макет.ПолучитьОбласть("Подвал");
	ОбластьПериодыНакопления 			= Макет.ПолучитьОбласть("ПериодыНакопления");
	ОбластьПустаяСтрока		 			= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Для Каждого СотрудникСсылка Из МассивОбъектов Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиСрезПервых.Период КАК Период,
			|	СотрудникиСрезПервых.Регистратор КАК Регистратор,
			|	СотрудникиСрезПервых.Организация КАК Организация,
			|	СотрудникиСрезПервых.Сотрудник КАК Сотрудник,
			|	СотрудникиСрезПервых.ВидОтпуска КАК ВидОтпуска,
			|	СотрудникиСрезПервых.КоличествоДнейОтпуска КАК КоличествоДнейОтпуска
			|ПОМЕСТИТЬ ВТ_Сотрудники
			|ИЗ
			|	РегистрСведений.Сотрудники.СрезПервых(&ПериодСрезаПервых, Сотрудник = &Сотрудник) КАК СотрудникиСрезПервых
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Сотрудники.Организация КАК Организация,
			|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
			|	ВТ_Сотрудники.ВидОтпуска КАК ВидОтпуска,
			|	ВТ_Сотрудники.КоличествоДнейОтпуска КАК КоличествоДнейОтпуска,
			|	ВТ_Сотрудники.Период КАК Период,
			|	ВТ_Сотрудники.Регистратор КАК Регистратор
			|ИЗ
			|	ВТ_Сотрудники КАК ВТ_Сотрудники
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СотрудникиСрезПоследних.Регистратор КАК Регистратор,
			|	СотрудникиСрезПоследних.Организация КАК Организация,
			|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
			|	СотрудникиСрезПоследних.ВидОтпуска КАК ВидОтпуска,
			|	СотрудникиСрезПоследних.КоличествоДнейОтпуска КАК КоличествоДнейОтпуска,
			|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	СотрудникиСрезПоследних.Должность КАК Должность
			|ИЗ
			|	РегистрСведений.Сотрудники.СрезПоследних(&ТекущаяДата, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтпускаСотрудниковСотрудники.ДатаНачала КАК Период,
			|	ДниОтпускаСотрудниковОбороты.Регистратор КАК Регистратор,
			|	ДниОтпускаСотрудниковОбороты.Организация КАК Организация,
			|	ДниОтпускаСотрудниковОбороты.Сотрудник КАК Сотрудник,
			|	ОтпускаСотрудниковСотрудники.ДатаНачала КАК ДатаНачала,
			|	ОтпускаСотрудниковСотрудники.ДатаОкончания КАК ДатаОкончания,
			|	ОтпускаСотрудниковСотрудники.КоличествоДней КАК КоличествоДней
			|ИЗ
			|	РегистрНакопления.ДниОтпускаСотрудников.Обороты(&ПериодСрезаПервых, &ТекущаяДата, Запись, ) КАК ДниОтпускаСотрудниковОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаСотрудников.Сотрудники КАК ОтпускаСотрудниковСотрудники
			|		ПО ДниОтпускаСотрудниковОбороты.Регистратор = ОтпускаСотрудниковСотрудники.Ссылка
			|			И ДниОтпускаСотрудниковОбороты.Организация = ОтпускаСотрудниковСотрудники.Ссылка.Организация
			|			И ДниОтпускаСотрудниковОбороты.Сотрудник = ОтпускаСотрудниковСотрудники.Сотрудник
			|ГДЕ
			|	ДниОтпускаСотрудниковОбороты.КоличествоДнейРасход > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
			|	ВТ_Сотрудники.ВидОтпуска КАК ВидОтпуска,
			|	ВТ_Сотрудники.Организация КАК Организация,
			|	ЕСТЬNULL(ДниОтпускаСотрудниковОбороты.КоличествоДнейПриход, 0) КАК КоличествоДней,
			|	ДниОтпускаСотрудниковОбороты.Период КАК Период,
			|	ВТ_Сотрудники.Период КАК ДатаНач,
			|	ВТ_Сотрудники.Период КАК ДатаКон
			|ИЗ
			|	ВТ_Сотрудники КАК ВТ_Сотрудники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДниОтпускаСотрудников.Обороты(&ПериодСрезаПервых, &ТекущаяДата, Запись, ) КАК ДниОтпускаСотрудниковОбороты
			|		ПО ВТ_Сотрудники.Организация = ДниОтпускаСотрудниковОбороты.Организация
			|			И ВТ_Сотрудники.Сотрудник = ДниОтпускаСотрудниковОбороты.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
			|	ВТ_Сотрудники.ВидОтпуска КАК ВидОтпуска,
			|	ВТ_Сотрудники.Организация КАК Организация,
			|	ЕСТЬNULL(ДниОтпускаСотрудниковОстатки.КоличествоДнейОстаток, 0) КАК КоличествоДней
			|ИЗ
			|	ВТ_Сотрудники КАК ВТ_Сотрудники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДниОтпускаСотрудников.Остатки(&ТекущаяДата, ) КАК ДниОтпускаСотрудниковОстатки
			|		ПО ВТ_Сотрудники.Организация = ДниОтпускаСотрудниковОстатки.Организация
			|			И ВТ_Сотрудники.Сотрудник = ДниОтпускаСотрудниковОстатки.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДругиеВидыОтсутствия.Период КАК Период,
			|	ДругиеВидыОтсутствия.Регистратор КАК Регистратор,
			|	ДругиеВидыОтсутствия.Сотрудник КАК Сотрудник,
			|	ДругиеВидыОтсутствия.Организация КАК Организация,
			|	ДругиеВидыОтсутствия.ДатаНачала КАК ДатаНачала,
			|	ДругиеВидыОтсутствия.ДатаОкончания КАК ДатаОкончания,
			|	-РАЗНОСТЬДАТ(ДругиеВидыОтсутствия.ДатаНачала, ДругиеВидыОтсутствия.ДатаОкончания, ДЕНЬ) КАК КоличествоДней
			|ИЗ
			|	РегистрСведений.ДругиеВидыОтсутствия КАК ДругиеВидыОтсутствия
			|ГДЕ
			|	ДругиеВидыОтсутствия.Сотрудник = &Сотрудник
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
		
		Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ПериодСрезаПервых", Дата('19800101'));
		Запрос.УстановитьПараметр("Сотрудник", СотрудникСсылка);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тзПервыйДокумент = МассивРезультатов[1].Выгрузить();
		тзТекущиеДанные = МассивРезультатов[2].Выгрузить();
		тзПериодыОтпусков = МассивРезультатов[3].Выгрузить();
		тзНакопленоОтпусков = МассивРезультатов[4].Выгрузить();
		тзОСтатокОтпуска = МассивРезультатов[5].Выгрузить();
		
		ОтпускКалендарныйГод = ЛОЖЬ;
		
		Если тзПервыйДокумент.Количество() > 0 Тогда 
			СтрокаПервогоДокумента = тзПервыйДокумент[0];
			Если СтрокаПервогоДокумента.ВидОтпуска = Справочники.ВидыОтпусков.КалендарныйГод Тогда 
				ОтпускКалендарныйГод = Истина;
				КоефициентНачисленияОтпуска = СтрокаПервогоДокумента.КоличествоДнейОтпуска / 365;
			Иначе 
				ОтпускКалендарныйГод = ЛОЖЬ;
				КоефициентНачисленияОтпуска = СтрокаПервогоДокумента.КоличествоДнейОтпуска / 365;
			КонецЕсли;
		Иначе
			Возврат ДокументРезультат;
		КонецЕсли;
		
		Если тзТекущиеДанные.Количество() > 0 Тогда 
			ТекущиеДанные = тзТекущиеДанные[0];
		Иначе
			Возврат ДокументРезультат;
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(ТекущиеДанные);
		ДокументРезультат.Вывести(ОбластьШапка);
		
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		
		ОбластьДокументДатаДокумента.Параметры.ПериодДокумента = Формат(СтрокаПервогоДокумента.Период, "ДЛФ=DD");
		ОбластьДокументДатаДокумента.Параметры.ДокументПредставление = СтрокаПервогоДокумента.Регистратор;
		ДокументРезультат.Вывести(ОбластьДокументДатаДокумента);
		
		Если ОтпускКалендарныйГод Тогда 
			ОбластьИнформацияПервогоДокумента.Параметры.КолвоДнейОтпуска = СтрокаПервогоДокумента.КоличествоДнейОтпуска;
		Иначе
			ОбластьИнформацияПервогоДокумента.Параметры.КолвоДнейОтпуска = СтрокаПервогоДокумента.КоличествоДнейОтпуска * 12;
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьИнформацияПервогоДокумента);
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		
		ПериодПред = СтрокаПервогоДокумента.Период;
		
		Для Каждого Строк Из тзПериодыОтпусков Цикл 
			
			КоличествоДнейНакопления = ПолучитьКоличествоДнейОтпускаЗаПериод(ОтпускКалендарныйГод, ПериодПред, Строк.Период, КоефициентНачисленияОтпуска, СтрокаПервогоДокумента.КоличествоДнейОтпуска);
			
			ОбластьДокументДатаДокумента.Параметры.ПериодДокумента = Формат(Строк.Период, "ДЛФ=DD");
			ОбластьДокументДатаДокумента.Параметры.ДокументПредставление = Строк.Регистратор;
			ДокументРезультат.Вывести(ОбластьДокументДатаДокумента);
		
			ОбластьНакоплено.Параметры.Период = Формат(ПериодПред, "ДЛФ=DD") + " - " + Формат(Строк.Период, "ДЛФ=DD");
			ОбластьНакоплено.Параметры.Количество = Окр(КоличествоДнейНакопления, 2);
			ДокументРезультат.Вывести(ОбластьНакоплено);
			
			ОбластьПериодОтпуска.Параметры.Период = Формат(Строк.ДатаНачала, "ДЛФ=DD") + " - " + Формат(Строк.ДатаОкончания, "ДЛФ=DD");
			ОбластьПериодОтпуска.Параметры.Количество = Строк.КоличествоДней;
			ДокументРезультат.Вывести(ОбластьПериодОтпуска);
			
			ДокументРезультат.Вывести(ОбластьПустаяСтрока);
			
			ПериодПред = Строк.Период;
			
		КонецЦикла;
		
		КоличествоДнейНакопления = ПолучитьКоличествоДнейОтпускаЗаПериод(ОтпускКалендарныйГод, Строк.Период, ТекущаяДата(), КоефициентНачисленияОтпуска, СтрокаПервогоДокумента.КоличествоДнейОтпуска);
		
		ОбластьПодвал.Параметры.Период = Формат(Строк.Период, "ДЛФ=DD") + " - " + Формат(НачалоДня(ТекущаяДата()), "ДЛФ=DD");
		ОбластьПодвал.Параметры.Количество = Окр(КоличествоДнейНакопления, 2);
		
		Если тзОСтатокОтпуска.Количество() > 0 Тогда 
			ОбластьПодвал.Параметры.КоличествоОстатка = тзНакопленоОтпусков[0].КоличествоДней;
		Иначе
			ОбластьПодвал.Параметры.КоличествоОстатка = 0;
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		ПериодПредПериода = СтрокаПервогоДокумента.Период;
		
		Если ОтпускКалендарныйГод Тогда 
			
			ДатаКонГод = ПолучитьДатуКОнчаГода(ПериодПредПериода);
			
			Пока ПериодПредПериода < КонецДня(ТекущаяДата()) Цикл 
			
				ОбластьПериодыНакопления.Параметры.ПериодКоличествоДней = Формат(ПериодПредПериода, "ДЛФ=DD") + " - " + Формат(НачалоДня(ДатаКонГод), "ДЛФ=DD") + " ("+Формат(СтрокаПервогоДокумента.КоличествоДнейОтпуска,"ЧДЦ=2")+"дн.)";
				ДокументРезультат.Вывести(ОбластьПериодыНакопления);
				
				
				ПроверкаПериода = ПолучитьДатуКОнчаГода(ДатаКонГод + (60*60*24));
				Если ПроверкаПериода < КонецДня(ТекущаяДата()) Тогда 
					ПериодПредПериода = ДатаКонГод + (60*60*24);
					ДатаКонГод = ПолучитьДатуКОнчаГода(ПериодПредПериода);
				Иначе
					ПериодПредПериода = ДатаКонГод + (60*60*24);
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			РазницаДатДней = Цел((НачалоДня(ТекущаяДата()) - ПериодПредПериода) / (60 * 60 * 24));
			НакопленоДней = КоефициентНачисленияОтпуска * РазницаДатДней;
			ОбластьПериодыНакопления.Параметры.ПериодКоличествоДней = Формат(ПериодПредПериода, "ДЛФ=DD") + " - " + Формат(НачалоДня(ТекущаяДата()), "ДЛФ=DD") + " ("+Формат(НакопленоДней,"ЧДЦ=2")+"дн.)";
			ДокументРезультат.Вывести(ОбластьПериодыНакопления);
			
		Иначе
			
			СуммаДней = 0;
			
			Для Каждого Строк Из тзНакопленоОтпусков Цикл 
				
				ДатаКонГод = ПолучитьДатуКОнчаГода(ПериодПредПериода);
				
				Если Строк.Период >= ПериодПредПериода 
					И Строк.Период <= ДатаКонГод Тогда 
					
					СуммаДней = СуммаДней + Строк.КоличествоДней;
					
				Иначе
					
					ОбластьПериодыНакопления.Параметры.ПериодКоличествоДней = Формат(ПериодПредПериода, "ДЛФ=DD") + " - " + Формат(НачалоДня(ДатаКонГод), "ДЛФ=DD") + " ("+Формат(СуммаДней,"ЧДЦ=2")+"дн.)";
					ДокументРезультат.Вывести(ОбластьПериодыНакопления);
					
					ПериодПредПериода = ДатаКонГод + (60*60*24);
					ДатаКонГод = ПолучитьДатуКОнчаГода(ПериодПредПериода);
					СуммаДней = 0;
					
				КонецЕсли;
				
				
			КонецЦикла;
			
			ОбластьПериодыНакопления.Параметры.ПериодКоличествоДней = Формат(ПериодПредПериода, "ДЛФ=DD") + " - " + Формат(НачалоДня(ТекущаяДата()), "ДЛФ=DD") + " ("+Формат(СуммаДней,"ЧДЦ=2")+"дн.)";
			ДокументРезультат.Вывести(ОбластьПериодыНакопления);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ПолучитьКоличествоДнейОтпускаЗаПериод(ОтпускКалендарныйГод = Истина, ДатаНача, ДатаКон, КоефициентНачисленияОтпуска, КоличествоДнейОтпуска)
	
	КоличествоДнейНакопления = 0;
	
	Если ОтпускКалендарныйГод Тогда
		КоличествоДнейНакопления = Цел((ДатаКон - ДатаНача) / 60 / 60 / 24) * КоефициентНачисленияОтпуска;
	Иначе
		Год1 = Год(ДатаКон);
		Год2 = Год(ДатаНача);
		Месяц1 = Месяц(ДатаКон);
		Месяц2 = Месяц(ДатаНача);
		КолвоДнейВТекМесяце = День(КонецМесяца(ДатаКон));
		КоефЭтогоМесяца = КоличествоДнейОтпуска / КолвоДнейВТекМесяце;
		НачисленоЗаТекМесяц = День(ДатаКон) * КоефЭтогоМесяца;
		Если Год1 = Год2 Тогда 
			НачисленоЗаМесяца = (Месяц1 - Месяц2) * КоличествоДнейОтпуска;
		Иначе
			КолвоЛет = Год1 - Год2;
			НачисленоЗаМесяца = (12 - Месяц1 + Месяц2 - 1) * КоличествоДнейОтпуска;
		КонецЕсли;
		
		КоличествоДнейНакопления = НачисленоЗаМесяца + НачисленоЗаТекМесяц;
	КонецЕсли;
	
	Возврат КоличествоДнейНакопления;
	
КонецФункции

Функция ПолучитьДатуКОнчаГода(Период);
	
	День = День(Период);
	Месяц = Месяц(Период);
	Год = Год(Период);
	
	Если День = 1 Тогда 
		Если Месяц = 1 Тогда 
			Возврат КонецДня(Дата(Год,12,31));
		Иначе 
			Возврат КонецМесяца(Дата(Год+1,Месяц-1,1));
		КонецЕсли;
	Иначе
		Возврат Дата(Год+1,Месяц,День-1);
	КонецЕсли;
	
КонецФункции

Процедура ТрудовойДоговорВывестиРаздел(ИмяОбласти, ДокументРезультат, Макет, ДанныеДоговора, ПараметрыНумерации)
	
	Если ИмяОбласти = "Раздел_ОхранаТруда"
		И (ДанныеДоговора.ТрудовойДоговорНаДистанционныеРаботы
			Или ДанныеДоговора.ТрудовойДоговорСНадомником) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбластьНачалаРаздела = Новый ТабличныйДокумент;
	НомерОбласти = 1;
	
	ОбластьРаздела = Макет.ПолучитьОбласть(ИмяОбласти);
	Для каждого ВложеннаяОбласть Из ОбластьРаздела.Области Цикл
		
		Если ОбластьРаздела.Области.Количество() > 1 И ВложеннаяОбласть.Имя = ИмяОбласти Тогда
			Продолжить;
		КонецЕсли;
		
		ВыводимаяОбласть = ОбластьРаздела.ПолучитьОбласть(ВложеннаяОбласть.Имя);
		
		Если ВложеннаяОбласть.Имя = "Пункт_14_б_Начисление"
				Или ВложеннаяОбласть.Имя = "Пункт_14_в_Начисление" Тогда
			
			Если ВложеннаяОбласть.Имя = "Пункт_14_б_Начисление" Тогда
				КоллекцияСтрок = ДанныеДоговора.КомпенсационныеВыплаты;
			ИначеЕсли ВложеннаяОбласть.Имя = "Пункт_14_в_Начисление" Тогда
				КоллекцияСтрок = ДанныеДоговора.СтимулирующиеВыплаты;
			Иначе
				КоллекцияСтрок = Новый Массив;
			КонецЕсли;
			
			Если КоллекцияСтрок.Количество() = 0 Тогда
				
				ВыводимаяОбласть.Параметры.Начисление =
					Символы.ПС
					+ Символы.ПС
					+ Символы.ПС
					+ Символы.ПС;
				
			Иначе
				
				ОбластьТаблицы = Новый ТабличныйДокумент;
				Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
					
					ВыводимаяОбласть.Параметры.Заполнить(СтрокаКоллекции);
					ВыводимаяОбласть.Параметры.Размер = Формат(ВыводимаяОбласть.Параметры.Размер, "ЧДЦ=2");
					ОбластьТаблицы.Вывести(ВыводимаяОбласть);
					
				КонецЦикла;
				
				ВыводимаяОбласть = ОбластьТаблицы;
				
			КонецЕсли;
			
		Иначе
			
			
			ВыводимаяОбласть.Параметры.Заполнить(ПараметрыНумерации);
			ВыводимаяОбласть.Параметры.Заполнить(ДанныеДоговора);
			
		КонецЕсли;
		
		Если НомерОбласти > 2 Тогда
			ДокументРезультат.Вывести(ВыводимаяОбласть);
		Иначе
			
			ОбластьНачалаРаздела.Вывести(ВыводимаяОбласть);
			Если НомерОбласти = 2 Тогда
				
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ОбластьНачалаРаздела) Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ДокументРезультат.Вывести(ОбластьНачалаРаздела);
				ОбластьНачалаРаздела = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НомерОбласти = НомерОбласти + 1;
		
		Если СтрДлина(ВложеннаяОбласть.Имя) = 8 И СтрНайти(ВложеннаяОбласть.Имя, "Пункт_") = 1 Тогда
			ПараметрыНумерации.НомерПункта = ПараметрыНумерации.НомерПункта + 1;
			УстановитьНомерПодпунктаВПараметрахНумерации(ПараметрыНумерации, 1);
		ИначеЕсли СтрЧислоВхождений(ВложеннаяОбласть.Имя, "_") = 2 Тогда
			УстановитьНомерПодпунктаВПараметрахНумерации(ПараметрыНумерации, ПараметрыНумерации.НомерПодпункта + 1);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбластьНачалаРаздела <> Неопределено Тогда
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ОбластьНачалаРаздела) Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьНачалаРаздела);
		
	КонецЕсли;
	
	Если СтрНайти(ИмяОбласти, "Раздел_") = 1 Тогда
		УстановитьНомерРазделаВПараметрахНумерации(ПараметрыНумерации, ПараметрыНумерации.НомерРаздела + 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНомерРазделаВПараметрахНумерации(ПараметрыНумерации, Знач НомерРаздела)
	
	ПараметрыНумерации.Вставить("НомерРаздела", НомерРаздела);
	ПараметрыНумерации.Вставить("НомерРазделаВРимскойНотации",
		СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(НомерРаздела, Ложь));
	
КонецПроцедуры

Процедура УстановитьНомерПунктаВПараметрахНумерации(ПараметрыНумерации, Знач НомерПункта)
	
	ПараметрыНумерации.Вставить("НомерПункта", НомерПункта);
	
КонецПроцедуры

Процедура УстановитьНомерПодпунктаВПараметрахНумерации(ПараметрыНумерации, Знач НомерПодпункта)
	
	ПараметрыНумерации.Вставить("НомерПодпункта", НомерПодпункта);
	ПараметрыНумерации.Вставить("НомерПодпунктаБуквой", Сред("абвгдежзиклмнопрстуфхцчшщ", НомерПодпункта, 1));
	
КонецПроцедуры


Функция ДанныеТрудовыхДоговоров(МассивОбъектов, ДистанционныеРаботы, ДоговорСНадомником) Экспорт
	
	ДанныеТрудовыхДоговоров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивПриказовОПриеме = Новый Массив;
	
	ВыводПоСсылкеНаСотрудника = Истина;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	Сотрудники.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникиДляПечатиТрудовыхДоговоров
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивОбъектов)";
	
	Запрос.Выполнить();
	
	Описатель = ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДляПечатиТрудовыхДоговоров");
	
	Описатель.ИмяВТКадровыеДанныеСотрудников = "ВТСотрудникиСДаннымиОПриеме";
	
	КадровыеДанныеПриема = "ДатаПриема,ПриказОПриеме";
	
	УчетСтраховыхВзносов.СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, КадровыеДанныеПриема);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиСДаннымиОПриеме.ПриказОПриеме
		|ИЗ
		|	ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме
		|ГДЕ
		|	ЕСТЬNULL(СотрудникиСДаннымиОПриеме.ПриказОПриеме, ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка)";
	
	МассивПриказовОПриеме = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПриказОПриеме");
	
	СоздатьВТДанныеДокументовПриемНаРаботу(Запрос.МенеджерВременныхТаблиц, МассивПриказовОПриеме);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриказыОПриеме.Ссылка,
		|	СотрудникиСДаннымиОПриеме.Сотрудник,
		|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК Период,
		|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК Дата,
		|	ПриказыОПриеме.ДлительностьИспытательногоСрока,
		|	ПриказыОПриеме.РазрешениеНаРаботу,
		|	ПриказыОПриеме.РазрешениеНаПроживание,
		|	ПриказыОПриеме.УсловияОказанияМедпомощи,
		|	ПриказыОПриеме.Руководитель,
		|	ПриказыОПриеме.ДолжностьРуководителя
		|ПОМЕСТИТЬ ВТДанныеПриказовОПриеме
		|ИЗ
		|	ВТДанныеДокументов КАК ПриказыОПриеме
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме
		|		ПО ПриказыОПриеме.Ссылка = СотрудникиСДаннымиОПриеме.ПриказОПриеме";
	
	Запрос.Выполнить();
	
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	УчетСтраховыхВзносов.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолейОтветственныхЛиц, "ВТДанныеПриказовОПриеме");
	
	СоздатьВТКадровыеДанныеТрудовогоДоговора(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиСДаннымиОПриеме", "Сотрудник,ДатаПриема");
	
	НачисленияСотрудников = Новый Соответствие;
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КадровыеДанные.Сотрудник
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
		|ГДЕ
		|	ЕСТЬNULL(КадровыеДанные.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='Сотрудник %1 не принят на работу';ru='Сотрудник %1 не принят на работу';en='% 1 employee is hired'"),
			Выборка.Сотрудник);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровыеДанные.Организация,
		|	КадровыеДанные.Период
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные";
	
	СведенияОбОрганизациях = Новый ТаблицаЗначений;
	СведенияОбОрганизациях.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	СведенияОбОрганизациях.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	СведенияОбОрганизациях.Колонки.Добавить("НаименованиеПолное", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ТелефонОрганизации", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ФаксОрганизации", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("АдресЮридический", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("АдресФактический", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ОрганизацияГородФактическогоАдреса", Новый ОписаниеТипов("Строка"));
	
	РезультатЗапросаПоШапке = Запрос.Выполнить();
	
	АдресаОрганизаций = КонтактнаяИнформацияУНФ.АдресаОрганизаций(РезультатЗапросаПоШапке.Выгрузить().ВыгрузитьКолонку("Организация"));
	
	Выборка = РезультатЗапросаПоШапке.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаСведенияОбОрганизациях = СведенияОбОрганизациях.Добавить();
		
		Сведения = Новый СписокЗначений;
		Сведения.Добавить("", "НаимЮЛПол");
		Сведения.Добавить("", "ИННЮЛ");
		Сведения.Добавить("", "КППЮЛ");
		Сведения.Добавить("", "ТелОрганизации");
		Сведения.Добавить("", "ФаксОрганизации");
		
		УстановитьПривилегированныйРежим(Истина);
		ОргСведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Выборка.Организация, Выборка.Период, Сведения);
		УстановитьПривилегированныйРежим(Ложь);
		
		НоваяСтрокаСведенияОбОрганизациях.Организация = Выборка.Организация;
		НоваяСтрокаСведенияОбОрганизациях.Период = Выборка.Период;
		
		Если ОргСведения.Свойство("НаимЮЛПол") Тогда
			НоваяСтрокаСведенияОбОрганизациях.НаименованиеПолное = ОргСведения.НаимЮЛПол;
		КонецЕсли;
		
		Если ОргСведения.Свойство("ИННЮЛ") Тогда
			НоваяСтрокаСведенияОбОрганизациях.ИНН = ОргСведения.ИННЮЛ;
		КонецЕсли;
		
		Если ОргСведения.Свойство("КППЮЛ") Тогда
			НоваяСтрокаСведенияОбОрганизациях.КПП = ОргСведения.КППЮЛ;
		КонецЕсли;
		
		Если ОргСведения.Свойство("ТелОрганизации") Тогда
			НоваяСтрокаСведенияОбОрганизациях.ТелефонОрганизации = ОргСведения.ТелОрганизации;
		КонецЕсли;
		
		Если ОргСведения.Свойство("ФаксОрганизации") Тогда
			НоваяСтрокаСведенияОбОрганизациях.ФаксОрганизации = ОргСведения.ФаксОрганизации;
		КонецЕсли;
		
		ОписаниеЮридическогоАдреса = КонтактнаяИнформацияУНФ.АдресОрганизации(
			АдресаОрганизаций,
			Выборка.Организация,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		НоваяСтрокаСведенияОбОрганизациях.АдресЮридический = ОписаниеЮридическогоАдреса.Представление;
		
		ОписаниеФактическогоАдреса = КонтактнаяИнформацияУНФ.АдресОрганизации(
			АдресаОрганизаций,
			Выборка.Организация,
			Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		НоваяСтрокаСведенияОбОрганизациях.АдресФактический = ОписаниеФактическогоАдреса.Представление;
		НоваяСтрокаСведенияОбОрганизациях.ОрганизацияГородФактическогоАдреса = ОписаниеФактическогоАдреса.Город;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СведенияОбОрганизациях", СведенияОбОрганизациях);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОбОрганизациях.Период,
		|	СведенияОбОрганизациях.Организация,
		|	СведенияОбОрганизациях.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	СведенияОбОрганизациях.ИНН КАК ИНН,
		|	СведенияОбОрганизациях.КПП КАК КПП,
		|	СведенияОбОрганизациях.ТелефонОрганизации КАК ТелефонОрганизации,
		|	СведенияОбОрганизациях.ФаксОрганизации КАК ФаксОрганизации,
		|	СведенияОбОрганизациях.АдресЮридический КАК ОрганизацияАдресЮридический,
		|	СведенияОбОрганизациях.АдресФактический КАК ОрганизацияАдресФактический,
		|	СведенияОбОрганизациях.ОрганизацияГородФактическогоАдреса КАК ОрганизацияГородФактическогоАдреса
		|ПОМЕСТИТЬ ВТДанныеОрганизаций
		|ИЗ
		|	&СведенияОбОрганизациях КАК СведенияОбОрганизациях
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСДаннымиОПриеме.Сотрудник КАК Ссылка,
		|	СотрудникиСДаннымиОПриеме.Сотрудник,
		|	СотрудникиСДаннымиОПриеме.ДатаПриема,
		|	КадровыеДанныеСотрудников.Подразделение,
		|	КадровыеДанныеСотрудников.Должность,
		|	КадровыеДанныеСотрудников.ВидЗанятости,
		|	ДанныеОрганизаций.Организация,
		|	ДанныеОрганизаций.ОрганизацияНаименованиеПолное,
		|	ДанныеОрганизаций.ИНН,
		|	ДанныеОрганизаций.КПП,
		|	ДанныеОрганизаций.ТелефонОрганизации,
		|	ДанныеОрганизаций.ФаксОрганизации,
		|	ДанныеОрганизаций.ОрганизацияАдресЮридический,
		|	ДанныеОрганизаций.ОрганизацияАдресФактический,
		|	ДанныеОрганизаций.ОрганизацияГородФактическогоАдреса,
		|	Организации.Наименование КАК ОрганизацияНаименованиеСокращенное,
		|	КадровыеДанныеСотрудников.Период,
		|	КадровыеДанныеСотрудников.Страна,
		|	КадровыеДанныеСотрудников.ФИОПолные КАК СотрудникФИОПолные,
		|	КадровыеДанныеСотрудников.АдресМестаПроживанияПредставление КАК СотрудникАдресМестаПроживания,
		|	КадровыеДанныеСотрудников.ДокументПредставление КАК СотрудникУдостоверениеЛичности,
		|	КадровыеДанныеСотрудников.СтраховойНомерПФР КАК СотрудникСНИЛС,
		|	КадровыеДанныеСотрудников.КлассУсловийТруда КАК УсловияТрудаНаРабочемМесте,
		|	КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ТрудовойДоговорДата,
		|	КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК ТрудовойДоговорНомер,
		|	КадровыеДанныеСотрудников.ДатаОкончания КАК ДатаЗавершенияТрудовогоДоговора,
		|	КадровыеДанныеСотрудников.ОснованиеСрочногоДоговора,
		|	КадровыеДанныеСотрудников.ДлительностьРабочейНедели КАК ДлительностьРабочейНедели,
		|	КадровыеДанныеСотрудников.ОписаниеДлительностиРабочейНеделиВДнях КАК ОписаниеДлительностиРабочейНеделиВДнях,
		|	КадровыеДанныеСотрудников.ПродолжительностьРабочегоДня КАК ПродолжительностьРабочегоДня,
		|	КадровыеДанныеСотрудников.СокращеннаяРабочаяНеделя КАК СокращеннаяРабочаяНеделя,
		|	КадровыеДанныеСотрудников.НеполноеРабочееВремя КАК НеполноеРабочееВремя,
		|	КадровыеДанныеСотрудников.КоличествоДнейОсновногоОтпуска КАК ДлительностьОсновногоОтпуска,
		|	КадровыеДанныеСотрудников.КоличествоДнейОтпускаЗаВредность КАК ДлительностьВредногоОтпуска,
		|	КадровыеДанныеСотрудников.КоличествоДнейСеверногоОтпуска КАК ДлительностьСеверногоОтпуска,
		|	КадровыеДанныеСотрудников.ОснованиеПредставителя КАК ОснованиеРуководителяВРодительномПадеже,
		|	ДанныеПриказовОПриеме.ДлительностьИспытательногоСрока,
		|	ДанныеПриказовОПриеме.РазрешениеНаРаботу,
		|	ДанныеПриказовОПриеме.РазрешениеНаПроживание,
		|	ДанныеПриказовОПриеме.УсловияОказанияМедпомощи,
		|	ДанныеПриказовОПриеме.ДолжностьРуководителя КАК РуководительДолжность,
		|	ФИОРуководителя.ФИО КАК РуководительФИОПолные,
		|	ФИОРуководителя.Пол КАК РуководительПол
		|ИЗ
		|	ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПриказовОПриеме КАК ДанныеПриказовОПриеме
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
		|			ПО ДанныеПриказовОПриеме.Дата = ФИОРуководителя.Дата
		|				И ДанныеПриказовОПриеме.Руководитель = ФИОРуководителя.ФизическоеЛицо
		|		ПО СотрудникиСДаннымиОПриеме.ДатаПриема = ДанныеПриказовОПриеме.Дата
		|			И СотрудникиСДаннымиОПриеме.Сотрудник = ДанныеПриказовОПриеме.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеТрудовогоДоговора КАК КадровыеДанныеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОрганизаций КАК ДанныеОрганизаций
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|				ПО ДанныеОрганизаций.Организация = Организации.Ссылка
		|			ПО КадровыеДанныеСотрудников.Организация = ДанныеОрганизаций.Организация
		|				И КадровыеДанныеСотрудников.Период = ДанныеОрганизаций.Период
		|		ПО СотрудникиСДаннымиОПриеме.Сотрудник = КадровыеДанныеСотрудников.Сотрудник";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеДоговора = ПараметрыТрудовогоДоговора(ДистанционныеРаботы, ДоговорСНадомником);
		
		ИсключаемыеИЗЗаполненияКолонки =
			"ДатаПриема,
			|ТрудовойДоговорДата,
			|ВидЗанятости,
			|ОрганизацияНаименованиеСокращенное,
			|ДатаЗавершенияТрудовогоДоговора,
			|ОснованиеСрочногоДоговора,
			|ДлительностьРабочейНедели,
			|ОписаниеДлительностиРабочейНеделиВДнях,
			|ПродолжительностьРабочегоДня";
		
		ЗаполнитьЗначенияСвойств(ДанныеДоговора, Выборка, , ИсключаемыеИЗЗаполненияКолонки);
		
		Если ЗначениеЗаполнено(Выборка.ТрудовойДоговорДата) Тогда
			ДанныеДоговора.ТрудовойДоговорДата = Формат(Выборка.ТрудовойДоговорДата, "ДЛФ=DD");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаЗавершенияТрудовогоДоговора) Тогда
			
			ДанныеДоговора.СрочностьТрудовогоДоговора = НСтр("ka='срочный трудовой договор';ru='срочный трудовой договор';en='fixed-term employment contract'");
			ДанныеДоговора.ДатаЗавершенияТрудовогоДоговора = Формат(Выборка.ДатаЗавершенияТрудовогоДоговора, "ДЛФ=DD");
			
			ДанныеДоговора.ОснованиеСрочногоДоговора = Выборка.ОснованиеСрочногоДоговора;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаПриема) Тогда
			
			ДанныеДоговора.ДатаПриема = Формат(Выборка.ДатаПриема, "ДЛФ=DD");
			Если Выборка.ТрудовойДоговорДата = NULL Тогда
				ДанныеДоговора.ТрудовойДоговорДата = ДанныеДоговора.ДатаПриема;
			КонецЕсли;
			
		Иначе
			ДанныеДоговора.ДатаПриема = Выборка.ТрудовойДоговорДата;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Выборка.ВидЗанятости) Тогда
		//	
		//	Если Выборка.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
		//		ДанныеДоговора.ВидЗанятости = НСтр("ka='по основной работе';ru='по основной работе';en='main job'");
		//	Иначе
		//		ДанныеДоговора.ВидЗанятости = НСтр("ka='по совместительству';ru='по совместительству';en='at the same time'");
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.УсловияТрудаНаРабочемМесте) Тогда
			ДанныеДоговора.УсловияТрудаНаРабочемМесте = Выборка.УсловияТрудаНаРабочемМесте;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДлительностьРабочейНедели) Тогда
			
			ДанныеДоговора.ДлительностьРабочейНедели =
				ЧислоПрописью(Выборка.ДлительностьРабочейНедели, "Л = ru_RU", НСтр("ka='час,часа,часов,м,,,,,0';ru='час,часа,часов,м,,,,,0';en='h, hour, hours, m ,,,,, 0'"))
				+ " " + НСтр("ka='в неделю';ru='в неделю';en='in Week'");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОписаниеДлительностиРабочейНеделиВДнях)
			Или Выборка.ОписаниеДлительностиРабочейНеделиВДнях = 0 Тогда
			
			Если Выборка.ОписаниеДлительностиРабочейНеделиВДнях = 5 Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ka='пятидневная с двумя выходными днями';ru='пятидневная с двумя выходными днями';en='of five days with two days off'");
			ИначеЕсли Выборка.ОписаниеДлительностиРабочейНеделиВДнях = 6 Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ka='шестидневная с одним выходными днем';ru='шестидневная с одним выходными днем';en='six-day with one day off'");
			ИначеЕсли Выборка.СокращеннаяРабочаяНеделя = Истина Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ka='неполная рабочая неделя';ru='неполная рабочая неделя';en='part-time'");
			ИначеЕсли Выборка.НеполноеРабочееВремя = Истина Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ka='сокращенное рабочее время';ru='сокращенное рабочее время';en='reduced working hours'");
			Иначе
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ka='рабочая неделя с предоставлением выходных дней по скользящему графику';ru='рабочая неделя с предоставлением выходных дней по скользящему графику';en='working week with provision weekend staggered'");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПродолжительностьРабочегоДня) Тогда
			ДанныеДоговора.ПродолжительностьРабочегоДня = Выборка.ПродолжительностьРабочегоДня;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОрганизацияНаименованиеСокращенное) Тогда
			ДанныеДоговора.ОрганизацияНаименованиеСокращенное = ", " + Выборка.ОрганизацияНаименованиеСокращенное;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
			
			ДанныеДоговора.ОрганизацияИННКПП = Выборка.ИНН;
			
			Если ЗначениеЗаполнено(Выборка.КПП) Тогда
				ДанныеДоговора.ОрганизацияИННКПП = ДанныеДоговора.ОрганизацияИННКПП + " / " + Выборка.КПП;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОснованиеРуководителяВРодительномПадеже) Тогда
			ДанныеДоговора.ОснованиеРуководителяВРодительномПадеже = Выборка.ОснованиеРуководителяВРодительномПадеже;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РуководительФИОПолные) Тогда
			
			РезультатСклонения = СклонениеПредставленийОбъектов.ПросклонятьФИО(Выборка.РуководительФИОПолные,2, , Выборка.РуководительПол);
			Если РезультатСклонения Тогда
				ДанныеДоговора.РуководительФИОПолныеВРодительномПадеже = РезультатСклонения;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДлительностьИспытательногоСрока) Тогда
			
			ДанныеДоговора.ИспытательныйСрок = НСтр("ka='устанавливается';ru='устанавливается';en='established'");
			ДанныеДоговора.ИспытательныйСрокМесяцев = Выборка.ДлительностьИспытательногоСрока;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РазрешениеНаПроживание) Тогда
			ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами = Выборка.РазрешениеНаПроживание
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РазрешениеНаРаботу) Тогда
			
			Если ЗначениеЗаполнено(ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами) Тогда
				
				ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами =
					ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами + ";" + Символы.ПС;
				
			КонецЕсли;
			
			ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами =
				ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами
				+ Выборка.РазрешениеНаРаботу;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РуководительДолжность) Тогда
			
			ДанныеДоговора.РуководительДолжностьВРодительномПадеже =
				СклонениеПредставленийОбъектов.ПросклонятьПредставление(Строка(Выборка.РуководительДолжность), 2, Выборка.РуководительДолжность);
			
		КонецЕсли;
		
		Периоды = НачисленияСотрудников.Получить(Выборка.Период);
		Если Периоды <> Неопределено Тогда
			
			ОписанияНачислений = Периоды.Получить(Выборка.Сотрудник);
			Если ОписанияНачислений <> Неопределено Тогда
				
				Если ЗначениеЗаполнено(ОписанияНачислений.ТарифнаяСтавка.Начисление) Тогда
					ДанныеДоговора.ТарифнаяСтавка = ПредставлениеТарифнойСтавкиДоговоровМикропредприятий(ОписанияНачислений.ТарифнаяСтавка);
				ИначеЕсли ЗначениеЗаполнено(ОписанияНачислений.СдельнаяОплатаТруда.Начисление) Тогда
					
					ДанныеДоговора.СдельнаяОплатаТруда = Строка(ОписанияНачислений.СдельнаяОплатаТруда.Начисление);
					Если ЗначениеЗаполнено(ОписанияНачислений.СдельнаяОплатаТруда.Размер) Тогда
						ДанныеДоговора.СдельнаяОплатаТруда = ДанныеДоговора.СдельнаяОплатаТруда + " " + Формат(ОписанияНачислений.СдельнаяОплатаТруда.Размер, "ЧДЦ=2");
					КонецЕсли;
					
				КонецЕсли;
				
				ДанныеДоговора.КомпенсационныеВыплаты = ОписанияНачислений.Компенсации;
				ДанныеДоговора.СтимулирующиеВыплаты = ОписанияНачислений.Надбавки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеТрудовыхДоговоров.Добавить(ДанныеДоговора);
		
	КонецЦикла;
	
	Возврат ДанныеТрудовыхДоговоров;
	
КонецФункции

Функция ПараметрыТрудовогоДоговора(ДистанционныеРаботы = Ложь, ДоговорСНадомником = Ложь)
	
	ПараметрыДоговора = Новый Структура;
	
	ПараметрыДоговора.Вставить("Ссылка");
	
	ПараметрыДоговора.Вставить("ТрудовойДоговорНомер", "__________");
	ПараметрыДоговора.Вставить("ТрудовойДоговорДата");
	
	ПараметрыДоговора.Вставить("ТрудовойДоговорНаДистанционныеРаботы", ДистанционныеРаботы);
	ПараметрыДоговора.Вставить("ТрудовойДоговорСНадомником", ДоговорСНадомником);
	ПараметрыДоговора.Вставить("ТрудовойДоговорСИностранцем", Ложь);
	ПараметрыДоговора.Вставить("ОснованиеСрочногоДоговора");
	
	ПараметрыДоговора.Вставить("СотрудникФИОПолные");
	ПараметрыДоговора.Вставить("СотрудникАдресМестаПроживания");
	ПараметрыДоговора.Вставить("СотрудникУдостоверениеЛичности");
	ПараметрыДоговора.Вставить("СотрудникСНИЛС");
	
	ПараметрыДоговора.Вставить("УсловияОказанияМедпомощи");
	ПараметрыДоговора.Вставить("ИныеДокументыПредставляемыеИностраннымиГражданами");
	
	ПараметрыДоговора.Вставить("ДатаПриема");
	ПараметрыДоговора.Вставить("Подразделение");
	ПараметрыДоговора.Вставить("Должность");
	ПараметрыДоговора.Вставить("УсловияТрудаНаРабочемМесте");
	ПараметрыДоговора.Вставить("СрочностьТрудовогоДоговора", НСтр("ka='трудовой договор на неопределенный срок';ru='трудовой договор на неопределенный срок';en='employment contract for an indefinite period'"));
	ПараметрыДоговора.Вставить("ДатаЗавершенияТрудовогоДоговора");
	ПараметрыДоговора.Вставить("ИспытательныйСрок", НСтр("ka='не устанавливается';ru='не устанавливается';en='not installed'"));
	ПараметрыДоговора.Вставить("ИспытательныйСрокМесяцев");
	ПараметрыДоговора.Вставить("ВидЗанятости");
	ПараметрыДоговора.Вставить("МестоОпределенияДолжностныхОбязанностей", НСтр("ka='в должностной инструкции';ru='в должностной инструкции';en='in the job description'"));
	
	ПараметрыДоговора.Вставить("ТарифнаяСтавка");
	ПараметрыДоговора.Вставить("СдельнаяОплатаТруда");
	ПараметрыДоговора.Вставить("КомпенсационныеВыплаты", Новый Массив);
	ПараметрыДоговора.Вставить("СтимулирующиеВыплаты", Новый Массив);
	
	ПараметрыДоговора.Вставить("ДлительностьРабочейНедели", НСтр("ka='40 часов в неделю';ru='40 часов в неделю';en='40 hours per week'"));
	ПараметрыДоговора.Вставить("ОписаниеДлительностиРабочейНеделиВДнях", НСтр("ka='пятидневная с двумя выходными днями';ru='пятидневная с двумя выходными днями';en='of five days with two days off'"));
	ПараметрыДоговора.Вставить("ПродолжительностьРабочегоДня", 8);
	
	ПараметрыДоговора.Вставить("ДлительностьОсновногоОтпуска", 28);
	ПараметрыДоговора.Вставить("ДлительностьВредногоОтпуска", 0);
	ПараметрыДоговора.Вставить("ДлительностьСеверногоОтпуска", 0);
	
	ПараметрыДоговора.Вставить("ОрганизацияНаименованиеПолное");
	ПараметрыДоговора.Вставить("ОрганизацияНаименованиеСокращенное");
	ПараметрыДоговора.Вставить("ОрганизацияГородФактическогоАдреса");
	ПараметрыДоговора.Вставить("ОрганизацияАдресЮридический");
	ПараметрыДоговора.Вставить("ОрганизацияАдресФактический");
	ПараметрыДоговора.Вставить("ОрганизацияИННКПП");
	
	ПараметрыДоговора.Вставить("РуководительДолжностьВРодительномПадеже");
	ПараметрыДоговора.Вставить("РуководительФИОПолныеВРодительномПадеже");
	ПараметрыДоговора.Вставить("ОснованиеРуководителяВРодительномПадеже", НСтр("ka='устава';ru='устава';en='charter'"));
	
	Возврат ПараметрыДоговора;
	
КонецФункции

Функция ПредставлениеТарифнойСтавкиДоговоровМикропредприятий(ОписаниеТарифнойСтавки)
	
	ПредставлениеТарифнойСтавки = "";
	
	ПредставлениеТарифнойСтавки = Строка(ОписаниеТарифнойСтавки.Начисление);
	Если ЗначениеЗаполнено(ОписаниеТарифнойСтавки.Размер) Тогда
		ПредставлениеТарифнойСтавки = ПредставлениеТарифнойСтавки + " " + Формат(ОписаниеТарифнойСтавки.Размер, "ЧДЦ=2");
	КонецЕсли;
	
	Возврат ПредставлениеТарифнойСтавки;
	
КонецФункции

// Возвращает структуру с параметрами для метода СоздатьВТКадровыеДанныеСотрудников.
//
// Параметры:
//		МенеджерВременныхТаблиц
//		ИмяВременнойТаблицыОтборовСотрудников - имя временной таблицы - "фильтра".
//		ИменаПолейВременнойТаблицыОтборовСотрудников - строка с именами полей отбора
//							сотрудников ",". Строка должна содержать два имени поля, разделенные
//							запятой. Первое имя соответствует полю "Сотрудник", второе полю "Период".
//
// Возвращаемое значение:
//		Структура с полями:
//			МенеджерВременныхТаблиц
//			ИмяВременнойТаблицыОтборовСотрудников - имя временной таблицы отборов сотрудников.
//			ПоляОтбораСотрудников - см. ПоляОтбораСотрудников.
//
Функция ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников = "Сотрудник,Период") Экспорт
	
	ОписательВременныхТаблиц = Новый Структура;
	
	ОписательВременныхТаблиц.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	ОписательВременныхТаблиц.Вставить("ИмяВременнойТаблицыОтборовСотрудников", ИмяВременнойТаблицыОтборовСотрудников);
	ОписательВременныхТаблиц.Вставить("ПоляОтбораСотрудников", ПоляОтбораСотрудников(ИменаПолейВременнойТаблицыОтборовСотрудников));
	ОписательВременныхТаблиц.Вставить("ИмяВТКадровыеДанныеСотрудников", "ВТКадровыеДанныеСотрудников");
	ОписательВременныхТаблиц.Вставить("ИмяВременнойТаблицыОтборовРазличныхСотрудников", "");
	
	ДополнитьСтруктуруПараметровИменамиТаблицСКадровойИсториейСотрудников(ОписательВременныхТаблиц);
	
	Возврат ОписательВременныхТаблиц;
	
КонецФункции

// Возвращает структуру описания полей отбора для методов получения кадровых данных сотрудников.
//
// Параметры:
//		ИменаПолейВременнойТаблицыОтборовСотрудников - строка с именами полей отбора
//							сотрудников ",". Строка должна содержать два имени поля, разделенные
//							запятой. Первое имя соответствует полю "Сотрудник", второе полю "Период".
//
// Возвращаемое значение:
//		Структура содержащая имена полей отбора сотрудников
//			 КлючиСтруктуры:
//			 	Сотрудник
//				Период
//
Функция ПоляОтбораСотрудников(ИменаПолейВременнойТаблицыОтборовСотрудников = "Сотрудник,Период") Экспорт
	
	МассивИменПолейОтбораСотрудников = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолейВременнойТаблицыОтборовСотрудников, ",", , Истина);
	Возврат Новый Структура("Сотрудник,Период", МассивИменПолейОтбораСотрудников[0], МассивИменПолейОтбораСотрудников[1]);
	
КонецФункции

Процедура ДополнитьСтруктуруПараметровИменамиТаблицСКадровойИсториейСотрудников(СтруктураПараметров) Экспорт
	
	ИменаТаблицСКадровойИсториейСотрудников = Новый Структура;
	ИменаТаблицСКадровойИсториейСотрудников.Вставить("ИмяВТКадроваяИсторияСотрудниковТаблицаРегистра", "");
	ИменаТаблицСКадровойИсториейСотрудников.Вставить("ИмяВТКадроваяИсторияСотрудниковСрезПоследних", "");
	
	СтруктураПараметров.Вставить("ИменаТаблицСКадровойИсториейСотрудников", ИменаТаблицСКадровойИсториейСотрудников);
	
КонецПроцедуры

Процедура СоздатьВТДанныеДокументовПриемНаРаботу(МенеджерВременныхТаблиц, МассивОбъектов) Экспорт
	
	ПечатьПоЭлементуСправочника = Ложь;
	Если МассивОбъектов.Количество() > 0 Тогда
		ПечатьПоЭлементуСправочника = ТипЗнч(МассивОбъектов[0]) = Тип("СправочникСсылка.Сотрудники");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриемНаРаботу.Ссылка,
		|	ПриемНаРаботу.Период КАК Дата,
		|	ПриемНаРаботу.Сотрудник,
		|	ПриемНаРаботу.Период КАК Период,
		|	ПриемНаРаботу.Ссылка.Номер КАК НомерДок,
		|	ПриемНаРаботу.Ссылка.Дата КАК ДатаДок,
		|	"""" КАК Руководитель,
		|	"""" КАК ДолжностьРуководителя,
		|	"""" КАК  УсловияПриема,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЗавершенияТрудовогоДоговора,
		|	"""" КАК ДлительностьИспытательногоСрока,
		|	"""" КАК РазрешениеНаРаботу,
		|	"""" КАК РазрешениеНаПроживание,
		|	"""" КАК УсловияОказанияМедпомощи
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботу
		|ГДЕ
		|	ПриемНаРаботу.Ссылка.Проведен
		|	И ПриемНаРаботу.Ссылка В(&МассивОбъектов)";
		
	Если ПечатьПоЭлементуСправочника Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПриемНаРаботу.Ссылка В(&МассивОбъектов)", "ПриемНаРаботу.Сотрудник В(&МассивОбъектов)");
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры


Процедура СоздатьВТКадровыеДанныеТрудовогоДоговора(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников) Экспорт
	
	// Получение кадровых данных сотрудника.
	ОписательВременныхТаблиц = ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		МенеджерВременныхТаблиц,
		ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников);
	
	КадровыеДанные =
		"ГоловнаяОрганизация,
		|Организация,
		|Подразделение,
		|Должность,
		|ВидЗанятости,
		|ФИОПолные,
		|АдресМестаПроживанияПредставление,
		|ДокументПредставление,
		|Страна,
		|КлассУсловийТруда,
		|СтраховойНомерПФР,
		|ПроцентСевернойНадбавки,
		|ТарифнаяСтавка";
	УчетСтраховыхВзносов.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ОснованиеПредставителя", НСтр("ka='Устава';ru='Устава';en='Charter'"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	NULL КАК ДатаДоговораКонтракта,
		|	NULL КАК НомерДоговораКонтракта,
		|	NULL КАК ДатаОкончания,
		|	NULL КАК ОснованиеСрочногоДоговора,
		|	NULL КАК ДлительностьРабочейНедели,
		|	NULL КАК ОписаниеДлительностиРабочейНеделиВДнях,
		|	NULL КАК ПродолжительностьРабочегоДня,
		|	NULL КАК СокращеннаяРабочаяНеделя,
		|	NULL КАК НеполноеРабочееВремя,
		|	28 КАК КоличествоДнейОсновногоОтпуска,
		|	NULL КАК КоличествоДнейОтпускаЗаВредность,
		|	NULL КАК КоличествоДнейСеверногоОтпуска,
		|	&ОснованиеПредставителя КАК ОснованиеПредставителя,
		|	КадровыеДанныеСотрудников.*
		|ПОМЕСТИТЬ ВТКадровыеДанныеТрудовогоДоговора
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников";
	
	Запрос.Выполнить();
	Запрос.Текст ="выБрать ВТКадровыеДанныеТрудовогоДоговора.* ИЗ ВТКадровыеДанныеТрудовогоДоговора";
	рез = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

#КонецОбласти


#КонецЕсли
